[
    {
        "title": "Legend of Legends Position Prediction",
        "year": 2025,
        "image": "../images/ezreal_LOL.jpg",
        "description": "Reiciendis assumenda facere doloremque laudantium minus quibusdam illum voluptas, cupiditate omnis quis quo aliquam dolore voluptates eveniet. Quibusdam cumque nam a ipsa quo, tempore quisquam. Nihil modi accusamus possimus illum!"
    },
    {
        "title": "Twitter Sentiment Analysis of College Students",
        "year":2025,
        "image": "../images/twitter.png",
        "description": "Odio neque molestias autem velit, laboriosam perferendis non temporibus et commodi. Quas dolorum eaque nisi nihil maiores, quaerat quos reiciendis temporibus architecto est odit, delectus quia nesciunt voluptatem alias obcaecati!"
    },
    {
        "title": "SkyCha Product Launch Plan",
        "year":2024,
        "image": "../images/SkyCha.jpg",
        "description": "Nemo atque delectus ipsa, consectetur mollitia non laborum fugit eveniet tenetur perspiciatis ullam, nesciunt beatae eius corrupti reiciendis veniam unde explicabo. Totam quasi tenetur distinctio, deleniti unde laudantium eaque fugiat."
    },
    {
        "title": "Corporis consequuntur vitae est?",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Dolorum, atque animi culpa minus voluptatem amet distinctio vero labore. Hic, esse sapiente? Ab, similique voluptas ut inventore a atque tempora alias fugit maxime distinctio ipsam asperiores cupiditate accusantium. Unde."
    },
    {
        "title": "Ipsa omnis veniam et.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Expedita, rem. Perspiciatis vel quas rem veniam id voluptate sit iure alias itaque, quibusdam sunt laudantium voluptatem non, sapiente quos! Corrupti perspiciatis, ipsum minus aut eaque officiis consequuntur debitis velit."
    },
    {
        "title": "Nam sed facere ducimus?",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "At odit mollitia minima hic, sed est incidunt facere voluptas fugit, odio, autem ea magnam nulla corporis dignissimos eveniet optio voluptatibus quo. Eum explicabo iste, enim exercitationem soluta vitae nesciunt."
    },
    {
        "title": "Quae beatae aut reprehenderit?",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "At, animi eveniet saepe sed aut hic consequuntur officiis alias doloremque aliquid mollitia in nam provident, reprehenderit natus et tempora. Minima quos fuga alias dignissimos ipsum a perspiciatis. Doloribus, est."
    },
    {
        "title": "Itaque reiciendis eveniet autem.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Deserunt, perspiciatis doloremque rerum rem ipsa laudantium necessitatibus amet fugiat nobis autem adipisci dolore odit, eveniet eligendi voluptatibus harum a nemo facere deleniti saepe dicta at id cumque. Consectetur, reprehenderit."
    },
    {
        "title": "Odio ipsum hic quasi.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Ea quasi rerum quos inventore cupiditate nobis ipsa accusantium at earum? Doloremque provident ullam, officiis fuga pariatur dolor dolores esse non consequatur sequi qui distinctio neque ex iusto sunt a."
    }
]